app/controllers/devise/registrations_controller.rb

SELECT "users".* FROM "users" ORDER BY "users".firstname ASC, "users".lastname ASC LIMIT 8 OFFSET 0
SELECT COUNT(*) FROM "users"
SELECT "profiles".* FROM "profiles" WHERE (published IS NOT FALSE) ORDER BY name ASC
SELECT "departments".* FROM "departments" WHERE (published IS NOT FALSE) ORDER BY name ASC
---
  def new
    @users = User.all.order(:firstname, :lastname).page(params[:page]).per(8)
    @alert_messages = params[:alert_messages]
  	@profiles = Profile.where("published IS NOT FALSE").order("name ASC")
  	@departments = Department.where("published IS NOT FALSE").order("name ASC")