app/views/devise/registrations/_users.html.erb

					  <span class = "cgreen">
					    <% @department = Department.find_by_id(user.department_id) %>
---
SELECT "departments".* FROM "departments" WHERE "departments"."id" = 3 LIMIT 1

					  <br />
					  <% @qualification = Qualification.find_by_id(user.qualification_id) %>
---
SELECT "qualifications".* FROM "qualifications" WHERE "qualifications"."id" = 6 LIMIT 1