app/views/shafts/index.html.erb

                    <ul class = "the-icons">
                      <% shaft.blocks.order("name").each do |block| %>
---
SELECT "blocks".* FROM "blocks" WHERE "blocks"."shaft_id" = $1 ORDER BY name  [["shaft_id", 1]]