app/views/departments/index.html.erb

                    <ul class = "the-icons">
                      <% department.qualifications.order("label").each do |qualification| %>
---
SELECT "qualifications".* FROM "qualifications" WHERE "qualifications"."department_id" = $1 ORDER BY label  [["department_id", 1]]