app/views/books/list.html.erb

SELECT "books".* FROM "books" WHERE "books"."category_id" = $1 ORDER BY title ASC  [["category_id", 1]]
---
                  <% @categories.each do |category| %>
                    <% @books = category.books.order("title ASC") %>