app/controllers/archive_boxes_controller.rb

  def index
    @archive_boxes = ArchiveBox.all.order("name").page(params[:page]).per(8)
---
SELECT "archive_boxes".* FROM "archive_boxes" ORDER BY name

  def create
    @name = params[:name]
    @error_messages = []
    @success_messages = []
    @archive_boxes = ArchiveBox.all.order("name").page(params[:page]).per(8)

    if @name.blank? then @error_messages << "Veuillez entrer le nom de la boîte d'archives à créer."; @archive_boxecss = "row-form error" else @archive_boxecss = "row-form" end
---
SELECT "archive_boxes".* FROM "archive_boxes" ORDER BY name
INSERT INTO "archive_boxes" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Mon, 26 May 2014 08:59:01 UTC +00:00], ["name", "BA-51"], ["updated_at", Mon, 26 May 2014 08:59:01 UTC +00:00]]