app/controllers/blocks_controller.rb

  def create
    @error_messages = []
    @success_messages = []
    @shaft_id = params[:post][:shaft_id]
    @block = params[:block_name]
    @shafts = Shaft.where("published IS NOT FALSE")
    @dropdown_shafts = Shaft.all.order("name")
    @shaft_namecss = @shaft_block_idcss = @block_namecss = "row-form"

    if @shaft_id.blank? then @error_messages << "Veuillez d'abord choisir un puits."; @shaft_block_idcss = "row-form error" end
    if @block.blank? then @error_messages << "Veuillez entrer le nom du bloc à créer."; @block_namecss = "row-form error" end

    if !Block.where("name = '#{@name}' AND shaft_id = #{@shaft_id}").blank?
      @error_messages << "Un bloc portant ce nom existe déjà dans ce puits."
    end

    if @error_messages.blank?
      @shaft = Shaft.find_by_id(@shaft_id)
---
SELECT "shafts".* FROM "shafts" WHERE (published IS NOT FALSE)
SELECT "shafts".* FROM "shafts" ORDER BY name
INSERT INTO "blocks" ("created_at", "name", "shaft_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Mon, 26 May 2014 08:53:09 UTC +00:00], ["name", "Bélier"], ["shaft_id", 2], ["updated_at", Mon, 26 May 2014 08:53:09 UTC +00:00]]
SELECT "blocks".* FROM "blocks" WHERE "blocks"."shaft_id" = $1 ORDER BY name  [["shaft_id", 1]]
SELECT "shafts".* FROM "shafts" WHERE "shafts"."id" = 2 LIMIT 1

  def get_blocks
    @shaft_id = params.first.first
    @blocks_options = "<option>-Veuillez choisir un bloc-</option>"
    @blocks = Shaft.find_by_id(@shaft_id).blocks.where("published IS NOT FALSE")
---
SELECT "blocks".* FROM "blocks" WHERE "blocks"."shaft_id" = $1 AND (published IS NOT FALSE)  [["shaft_id", 2]]
SELECT "shafts".* FROM "shafts" WHERE "shafts"."id" = 2 LIMIT 1