app/controllers/books_controller.rb

  def codes
    @categories = Category.where("published IS NOT FALSE").order("name")
    @shafts = Shaft.where("published IS NOT FALSE").order("name")
    @consultants = Consultant.where("published IS NOT FALSE").order("name")
    @archives_boxes = ArchiveBox.where("published IS NOT FALSE").order("name")
---
SELECT "categories".* FROM "categories" WHERE (published IS NOT FALSE) ORDER BY name
SELECT "shafts".* FROM "shafts" WHERE (published IS NOT FALSE) ORDER BY name
SELECT "consultants".* FROM "consultants" WHERE (published IS NOT FALSE) ORDER BY name
SELECT "archive_boxes".* FROM "archive_boxes" WHERE (published IS NOT FALSE) ORDER BY name

  def create
    @categories = Category.where("published IS NOT FALSE").order("name")
    @shafts = Shaft.where("published IS NOT FALSE").order("name")
    @consultants = Consultant.where("published IS NOT FALSE").order("name")
    @archives_boxes = ArchiveBox.where("published IS NOT FALSE").order("name")
---
SELECT "categories".* FROM "categories" WHERE (published IS NOT FALSE) ORDER BY name
SELECT "shafts".* FROM "shafts" WHERE (published IS NOT FALSE) ORDER BY name
SELECT "consultants".* FROM "consultants" WHERE (published IS NOT FALSE) ORDER BY name
SELECT "archive_boxes".* FROM "archive_boxes" WHERE (published IS NOT FALSE) ORDER BY name

    params[:shaft_id] = nil

    if @error_messages.blank?
      @code = "#{Category.find_by_id(@category_id).short_code}~#{@title.strip}~#{Shaft.find_by_id(@shaft_id).name}~#{@block}~#{DateTime.parse(@publication_date).strftime("%d-%m-%y")}~#{Consultant.find_by_id(@consultant_id).name}~#{ArchiveBox.find_by_id(@archive_box_id).name}"
      if Book.find_by_code(@code).blank?
        Book.create(code: @code, title: @title.strip, description: @description.strip, total_quantity: @total_quantity.to_i, quantity_in_stock: @total_quantity.to_i, category_id: @category_id, block_id: Block.find_by_name(@block).id, consultant_id: @consultant_id, archive_box_id: @archive_box_id, geographic_position: @geographic_position, publication_date: @publication_date_status)
---
SELECT "archive_boxes".* FROM "archive_boxes" WHERE "archive_boxes"."id" = 1 LIMIT 1
SELECT "categories".* FROM "categories" WHERE "categories"."id" = 1 LIMIT 1
SELECT "consultants".* FROM "consultants" WHERE "consultants"."id" = 1 LIMIT 1
SELECT "shafts".* FROM "shafts" WHERE "shafts"."id" = 1 LIMIT 1
SELECT "books".* FROM "books" WHERE "books"."code" = 'DIA~Analyse structurelle des sols~Dabou~Pangolin~23-12-11~Essonne~BA-51' LIMIT 1
INSERT INTO "books" ("archive_box_id", "block_id", "category_id", "code", "consultant_id", "created_at", "description", "geographic_position", "publication_date", "title", "total_quantity", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
SELECT "blocks".* FROM "blocks" WHERE "blocks"."name" = 'Pangolin' LIMIT 1

  def send_request
    @books = Book.where("published IS NOT FALSE AND quantity_in_stock > 0").order("title")
---
SELECT "books".* FROM "books" WHERE (published IS NOT FALSE AND quantity_in_stock > 0) ORDER BY title

  def search_all_books
    @terms = params[:terms]
    @sql = ""
    @results = ""

    if @terms.blank?
      @books = Book.all.order("title")
    else
      @terms = @terms.strip.split

      if Book.where("#{sql_for_all_books(@terms)}").blank?
        @sql = "" #sql_for_categories(@terms).sub(/^AND/, '')
      else
        @sql = sql_for_all_books(@terms) << sql_for_categories(@terms)
      end

      @books = Book.where("#{@sql}").order("title")
      if @sql.blank?
        @books = nil
      end
    end
    unless @books.blank?
      @books = @books.page(params[:page]).per(8)
---
SELECT "books".* FROM "books" WHERE (((( title ILIKE '%struct%' OR code ILIKE '%struct%') AND( title ILIKE '%dab%' OR code ILIKE '%dab%') ))) ORDER BY title
SELECT "books".* FROM "books" WHERE (((( title ILIKE '%struct%' OR code ILIKE '%struct%') AND( title ILIKE '%dab%' OR code ILIKE '%dab%') ))) ORDER BY title LIMIT 8 OFFSET 0
SELECT COUNT(*) FROM "books" WHERE (((( title ILIKE '%struct%' OR code ILIKE '%struct%') AND( title ILIKE '%dab%' OR code ILIKE '%dab%') )))

  def list
    @categories = Category.order("name ASC")
---
SELECT "categories".* FROM "categories" ORDER BY name ASC

  def list_books_per_category
    @category = Category.find_by_id(params[:category_id])
    if @category.blank?
      redirect_to :back
    else
      @books = @category.books.page(params[:page]).per(8)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = 1 LIMIT 1
SELECT "books".* FROM "books" WHERE "books"."category_id" = $1 LIMIT 8 OFFSET 0  [["category_id", 1]]
SELECT COUNT(*) FROM "books" WHERE "books"."category_id" = $1  [["category_id", 1]]

	def edit
	  @book = Book.find_by_id(params[:book_id])
	  @categories = Category.where("published IS NOT FALSE").order("name")
    @shafts = Shaft.where("published IS NOT FALSE").order("name")
    @consultants = Consultant.where("published IS NOT FALSE").order("name")
    @archives_boxes = ArchiveBox.where("published IS NOT FALSE").order("name")
---
SELECT "books".* FROM "books" WHERE "books"."id" = 1 LIMIT 1
SELECT "categories".* FROM "categories" WHERE (published IS NOT FALSE) ORDER BY name
SELECT "shafts".* FROM "shafts" WHERE (published IS NOT FALSE) ORDER BY name
SELECT "consultants".* FROM "consultants" WHERE (published IS NOT FALSE) ORDER BY name
SELECT "archive_boxes".* FROM "archive_boxes" WHERE (published IS NOT FALSE) ORDER BY name