app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" ORDER BY name
---
  def index
    @categories = Category.all.order("name")

SELECT "categories".* FROM "categories" ORDER BY name
INSERT INTO "categories" ("created_at", "name", "short_code", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Mon, 26 May 2014 08:51:28 UTC +00:00], ["name", "Diagraphies"], ["short_code", "DIA"], ["updated_at", Mon, 26 May 2014 08:51:28 UTC +00:00]]
---
  def create
    @name = params[:name]
    @short_code = params[:short_code]
    @error_messages = []
    @success_messages = []
    @categories = Category.all.order("name")

    if @name.blank? then @error_messages << "Veuillez entrer le nom de la catégorie à créer."; @namecss = "row-form error" else @namecss = "row-form" end
    if @short_code.blank? or @short_code.length != 3 then @error_messages << "L'abbréviation a une taille de 3 caractères."; @short_namecss = "row-form error" else @short_namecss = "row-form" end

    params[:name] = @name.strip
    params[:short_code] = @short_code.strip.upcase

    if @error_messages.blank?
      Category.create(:name => @name.strip, :short_code => @short_code.strip.upcase)