app/controllers/consultants_controller.rb

  def index
    @consultants = Consultant.all.order("name")
---
SELECT "consultants".* FROM "consultants" ORDER BY name

  def create
    @name = params[:name]
    @error_messages = []
    @success_messages = []
    @consultants = Consultant.all.order("name")

    if @name.blank? then @error_messages << "Veuillez entrer le nom du consultant à créer."; @namecss = "row-form error" else @namecss = "row-form" end
---
SELECT "consultants".* FROM "consultants" ORDER BY name
INSERT INTO "consultants" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Mon, 26 May 2014 08:54:14 UTC +00:00], ["name", "Essonne"], ["updated_at", Mon, 26 May 2014 08:54:14 UTC +00:00]]