app/controllers/departments_controller.rb

SELECT "departments".* FROM "departments" WHERE (published IS NOT FALSE)
SELECT "departments".* FROM "departments" ORDER BY name
---
  def index
    @departments = Department.where("published IS NOT FALSE")
    @dropdown_departments = Department.order("name")