app/controllers/shafts_controller.rb

  def index
    @shafts = Shaft.where("published IS NOT FALSE")
    @dropdown_shafts = Shaft.all.order("name")
---
SELECT "shafts".* FROM "shafts" WHERE (published IS NOT FALSE)
SELECT "shafts".* FROM "shafts" ORDER BY name

  def create
    @shaft_name = params[:shaft_name]
    @shaft_block_idcss = @block_namecss = "row-form"
    @error_messages = []
    @success_messages = []
    @shafts = Shaft.where("published IS NOT FALSE")
    @dropdown_shafts = Shaft.all.order("name")

    if @shaft_name.blank? then @error_messages << "Veuillez entrer le nom du puits à créer."; @shaft_namecss = "row-form error" else @shaft_namecss = "row-form" end
---
SELECT "shafts".* FROM "shafts" WHERE (published IS NOT FALSE)
SELECT "shafts".* FROM "shafts" ORDER BY name
INSERT INTO "shafts" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Mon, 26 May 2014 08:52:41 UTC +00:00], ["name", "Dabou"], ["updated_at", Mon, 26 May 2014 08:52:41 UTC +00:00]]